app/Controllers/Product.php

SELECT *
FROM `products`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function index()
    {
        $products = $this->productModel->paginate(10, 'products');

INSERT INTO `products` (`photo`, `title`, `caption`, `category`) VALUES ('1684423381_3b3ffa668d8c968868e6.png', '2giiinn', 'gggghhhhhhhhhhh', 'Life_Culture')
---
    public function create()
    {

        $fileName = "";

        $photo = $this->request->getFile('photo');

        if ($photo) {
            $fileName = $photo->getRandomName(); // Mendapatkan nama file baru secara acak

            $photo->move('photos', $fileName); // Memindahkan file ke public/photos dengan nama acak
        }

        $payload = [
            "photo" => $fileName,
            "title" => $this->request->getPost('title'),
            "caption" => $this->request->getPost('caption'),
            "category" => $this->request->getPost('category'),

        ];

        $this->productModel->insert($payload);

DELETE FROM `products`
WHERE `id` IN ('1')
---
    public function delete($id = null)
    {
        $this->productModel->delete($id);