app/Controllers/User.php

SELECT *
FROM `products`
WHERE `category` = 'Tren_Fashion'
SELECT *
FROM `products`
WHERE `category` = 'Tren_Fashion'
ORDER BY `id` DESC
 LIMIT 1
---
public function fashion()
{
    $products = $this->productModel->where('category', 'Tren_Fashion')->findAll();
    $product = $this->productModel->where('category', 'Tren_Fashion')->first();

SELECT *
FROM `products`
WHERE `category` = 'Beauty'
SELECT *
FROM `products`
WHERE `category` = 'Beauty'
 LIMIT 1
---
public function beauty()
{
    $products = $this->productModel->where('category', 'Beauty')->findAll();
    $product = $this->productModel->where('category', 'Beauty')->first();

SELECT *
FROM `products`
WHERE `category` = 'Life_Culture'
SELECT *
FROM `products`
WHERE `category` = 'Life_Culture'
 LIMIT 1
---
public function lifestyle()
{
    $products = $this->productModel->where('category', 'Life_Culture')->findAll();
    $product = $this->productModel->where('category', 'Life_Culture')->first();

SELECT *
FROM `products`
ORDER BY `id` DESC
 LIMIT 3
---
public function home()
{
    $products = $this->productModel->orderBy('id', 'desc')->findAll();

SELECT *
FROM `products`
WHERE `id` = '3'
 LIMIT 1
INSERT INTO `visitors` (`id_product`, `category`, `date_visit`) VALUES ('3', 'Tren_Fashion', '2023-05-30')
---
public function detail($id)
{
    $product = $this->productModel->where('id', $id)->first();

    $data = [
        'product' => $product
    ];

    if($id != 0){
        $payload = [
            "id_product" => $id,
            "category" => $product['category'],
            "date_visit" => date('Y-m-d')
        ];

        $this->VisitorModel->insert($payload);